#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//1.不创建临时变量，交换5和3
// 方法一：如果a,b比较大，a+b会溢出
//int main()
//{
//	int a = 5;
//	int b = 3;
//	printf("%d %d\n", a, b);
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	printf("%d %d\n", a, b);
//	return 0;
//}
//方法二
//int main()
//{
//	int a = 5;
//	int b = 3;
//	printf("%d %d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;//即b = a ^ b ^ b
//	a = a ^ b;//即a = a ^ b ^ a = 5 ^ 3 ^ 5
//	printf("%d %d\n", a, b);
//	return 0;
//}

//2.求一个整数存在内存中二进制1的个数
//int main()
//{
//	int a = 11;
//	//00000000000000000000000000001011
//	//和1按位与
//	//00000000000000000000000000000001
//	//最低位看a,a是1，就为1，反之为0
//	//不断右移判断最低位
//	int sum = 0;
//	int n = 0;
//	while (n<31)
//	{
//		sum += a & 1;
//		a = a >> 1;
//		n++;
//	}
//	printf("%d", sum);
//	return 0;
//}

//3.修改a=3的第四位为1，并且改回来
//int main()
//{
//	int a = 3;
//	//00000000000000000000000000000011
//	//00000000000000000000000000001000
//	a |= (1 << 3);
//	printf("%d\n", a);
//	//改回来,现在已经变成000000000000000000000000000001011
//	//           按位与上111111111111111111111111111110111
//	a &= (~(1 << 3));
//	printf("%d\n", a);
//	return 0;
//}

//4.后置++
//int main()
//{
//	int a = 10;
//	printf("%d\n", a++);//就是打印a之后再把a改为11
//	printf("%d\n", a);
//	return 0;
//}

//5.两个写法的效果一样
//int main()
//{
//	float a = 3.14;
//	float b = 3.14f;
//	printf("%f", a);
//	printf("%f", b);
//	return 0;
//}

//6.